src/Documents/ОплатаУчастниками.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Document>
		<Properties>
			<Name>ОплатаУчастниками</Name>
			<BasedOn>
				<xr:Item>Document.УчастиеВМероприятии</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗадолженностьКазначея</xr:Item>
				<xr:Item>AccumulationRegister.ЗадолженностьУчастников</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Мероприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Участник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Участники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатыВТабличнойЧасти</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Оплаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Мероприятие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Участник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Участники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/AccumulationRegisters/ЗадолженностьУчастников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<AccumulationRegister>
		<Properties>
			<Name>ЗадолженностьУчастников</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Мероприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Участник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Участники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/AccumulationRegisters/ЗадолженностьКазначея.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<AccumulationRegister>
		<Properties>
			<Name>ЗадолженностьКазначея</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Мероприятие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

src/Documents/ОплатаУчастниками/Ext/ObjectModule.bsl
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.УчастиеВМероприятии") Тогда
		// Заполнение шапки
		ОплатыВТабличнойЧасти = Истина;
		// Заполнение таб.части
		Для Каждого СтрокаТЧ Из ДанныеЗаполнения.Участники Цикл
			НоваяСтрока = Оплаты.Добавить();
			НоваяСтрока.Мероприятие = ДанныеЗаполнения.Мероприятие;
			НоваяСтрока.Участник = СтрокаТЧ.Участник;
			НоваяСтрока.Сумма = ДанныеЗаполнения.Мероприятие.СтоимостьУчастия;
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ЗадолженностьУчастников.Записывать = Истина;
	Движения.ЗадолженностьКазначея.Записывать = Истина;
	
	Если ОплатыВТабличнойЧасти Тогда
		Для Каждого СтрокаТЧ Из Оплаты Цикл
			// регистр Задолженность Расход
			Движение = Движения.ЗадолженностьУчастников.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Мероприятие = СтрокаТЧ.Мероприятие;
			Движение.Участник = СтрокаТЧ.Участник;
			Движение.Сумма = СтрокаТЧ.Сумма;
			// регистр ЗадолженностьКазначея Приход
			Движение = Движения.ЗадолженностьКазначея.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Мероприятие = СтрокаТЧ.Мероприятие;
			Движение.Сумма = СтрокаТЧ.Сумма;
		КонецЦикла;
	Иначе 
		// регистр Задолженность Расход
		Движение = Движения.ЗадолженностьУчастников.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Мероприятие = Мероприятие;
		Движение.Участник = Участник;
		Движение.Сумма = Сумма;
		// регистр ЗадолженностьКазначея Приход
		Движение = Движения.ЗадолженностьКазначея.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Мероприятие = Мероприятие;
		Движение.Сумма = Сумма;
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОплатыВТабличнойЧасти Тогда
		МассивМероприятий = ОбщегоНазначения.ПолучитьМассивУникальныхЗначенийКолонки(Оплаты, "Мероприятие");
		Мероприятие = ?(МассивМероприятий.Количество() = 1, МассивМероприятий[0], Справочники.Мероприятия.ПустаяСсылка());
		МассивУчастников = ОбщегоНазначения.ПолучитьМассивУникальныхЗначенийКолонки(Оплаты, "Участник");
		Участник = ?(МассивУчастников.Количество() = 1, МассивУчастников[0], Справочники.Участники.ПустаяСсылка());
		Сумма = Оплаты.Итог("Сумма");
	Иначе
		Оплаты.Очистить();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

	Если ОплатыВТабличнойЧасти Тогда
		ПроверяемыеРеквизиты.Добавить("Оплаты.Мероприятие");
		ПроверяемыеРеквизиты.Добавить("Оплаты.Участник");
	Иначе
		ПроверяемыеРеквизиты.Добавить("Мероприятие");
		ПроверяемыеРеквизиты.Добавить("Участник");
	КонецЕсли;

КонецПроцедуры
